<?php

use Illuminate\Database\Seeder;
use App\Assetmodel;
use Carbon\Carbon;

class AssetmodelsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        Assetmodel::insert([
            'branch_id' => '1',
            'asset_m_no' => '1',
            'a_g_id' => '11',
            'name_th' => 'ชุดเครื่องมือ TIGON 30 ชิ้น',
            'name_en' => '',
            'desc' => 'อุปกรณ์ช่างพื้นฐานครบครันรวมกันมากถึง 30 ชิ้น เหมาะสำหรับงานซ่อมแซมเฟอร์นิเจอร์, จักรยาน, อุปกรณ์อิเล็กทรอนิกส์, รถยนต์ เป็นต้น ในชุดประกอบด้วยประแจรูปตัว L เจ็ดไซส์, หรือไขควงหกเหลี่ยม, ดอกไขควงหลากหลายขนาด',
            'trash' =>0,
            'created_at' => Carbon::now(),
        ]);
        Assetmodel::insert([
            'branch_id' => '1',
            'asset_m_no' => '2',
            'a_g_id' => '11',
            'name_th' => 'ชุดเครื่องมือช่าง 77 ชิ้น/ชุด MATALL',
            'name_en' => '',
            'desc' => 'ผลิตมาจากวัสดุที่มีคุณภาพ ทนต่อการใช้งานทำให้มีอายุการใช้งานที่ยาวนาน
            ใช้งานได้สะดวก ประหยัดพื้นที่ในการจัดเก็บ
            สะดวกต่อการพกพา ด้วยอุปกรณ์ที่ครบถ้วนในกล่องเดียว
            ด้ามจับกระชับ จับถนัดและสบายมือ
            ใช้สำหรับงานช่าง และงานซ่อมแซมทั่วไป',
            'trash' =>0,
            'created_at' => Carbon::now(),
        ]);
        Assetmodel::insert([
            'branch_id' => '1',
            'asset_m_no' => '3',
            'a_g_id' => '11',
            'name_th' => 'ชุดเครื่องมือช่าง MATALL 22 ชื้น/ชุด',
            'name_en' => '',
            'desc' => 'ตอบโจทย์งานช่างพื้นฐาน ด้วยชุดเครื่องมือช่างเบื้องต้น MATALL เหมาะสำหรับงานซ่อมแซม หรืองาน DIY ต่าง ๆ โดยมีทั้งหมด 22 ชิ้น ได้แก่ ไขควงหกเหลี่ยมหลากหลายไซส์, ไขควงหัวแฉก, ระดับน้ำ, ค้อนหงอนพร้อมด้ามจับหุ้มนาง, คีม, เทปกาว และคัตเตอร์',
            'trash' =>0,
            'created_at' => Carbon::now(),
        ]);
        Assetmodel::insert([
            'branch_id' => '1',
            'asset_m_no' => '4',
            'a_g_id' => '11',
            'name_th' => 'ชุดเครื่องมือช่าง MATALL 8 ชิ้น/ชุด',
            'name_en' => '',
            'desc' => 'ตอบโจทย์งานช่างพื้นฐาน ด้วยชุดเครื่องมือช่างเบื้องต้น MATALL เหมาะสำหรับงานซ่อมแซม หรืองาน DIY ต่าง ๆ โดยมีทั้งหมด 8 ชิ้น ได้แก่ ประแจ, ค้อนด้ามจับหุ้มยาง และไขควงปากแบน/หัวแฉกอย่างละ 3 ไซส์',
            'trash' =>0,
            'created_at' => Carbon::now(),
        ]);
        Assetmodel::insert([
            'branch_id' => '1',
            'asset_m_no' => '5',
            'a_g_id' => '11',
            'name_th' => 'ชุดกล่องเครื่องมือ MATALL PRO 62 ชิ้น/ชุด',
            'name_en' => '',
            'desc' => 'ชุดกล่องเครื่องมือ MATALL PRO แต่ละชิ้นผ่านกระบวนการผลิตมาตรฐาน เหมาะสำหรับใช้งานปรับปรุงซ่อมแซม และติดตั้งอุปกรณ์ต่าง ๆ มาพร้อมชุดเครื่องมือ 62 ชิ้น อาทิ ประแจเลื่อน, ลูกบ็อกซ์, ไขควงแฉก, ไขควงปากแบน, ตลับเมตร, คัตเตอร์ เป็นต้น ง่ายต่อการทำงานด้วยอุปกรณ์ที่ครบถ้วนในกล่องเดียว',
            'trash' =>0,
            'created_at' => Carbon::now(),
        ]);
    }
}
